# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [48, 3, 2]] # 0-P1/2
  - [-1, 1, SGBlock, [96, 2, 2]] # 1-P2/4
  - [-1, 1, SGBlock, [144, 1, 6]] # 2
  - [-1, 1, SGBlock, [192, 1, 6]]
  - [-1, 1, SGBlock, [192, 1, 6]]
  - [-1, 1, SGBlock, [192, 2, 6]] # 5-P3/8
  - [-1, 1, SGBlock, [288, 1, 6]]
  - [-1, 1, SGBlock, [288, 1, 6]]
  - [-1, 1, SGBlock, [288, 2, 6]] # 8-P4/16
  - [-1, 1, SGBlock, [384, 1, 6]]
  - [-1, 1, SGBlock, [384, 1, 6]]
  - [-1, 1, SGBlock, [384, 1, 6]]
  - [-1, 1, SGBlock, [384, 1, 6]] # 12
  - [-1, 1, SGBlock, [576, 1, 6]]
  - [-1, 1, SGBlock, [576, 1, 6]]
  - [-1, 1, SGBlock, [576, 1, 6]] # 15
  - [-1, 1, SGBlock, [576, 2, 6]] # 16-P5/32
  - [-1, 1, SGBlock, [960, 1, 6]]
  - [-1, 1, SGBlock, [960, 1, 6]]
  - [-1, 1, SGBlock, [960, 1, 6]] # 19
  - [-1, 1, SGBlock, [1280, 1, 6]] # 20
  - [-1, 1, SPPF, [1024, 5]] # 21

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 15], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 24

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 27 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 24], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 30 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 21], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 33 (P5/32-large)

  - [[27, 30, 33], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
