# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, PatchEmbed_FasterNet, [40, 4, 4]] # 0-P1/4
  - [-1, 1, BasicStage, [40, 1]] # 1
  - [-1, 1, PatchMerging_FasterNet, [80, 2, 2]] # 2-P2/8
  - [-1, 2, BasicStage, [80, 1]] # 3-P3/16
  - [-1, 1, PatchMerging_FasterNet, [160, 2, 2]] # 4
  - [-1, 8, BasicStage, [160, 1]] # 5-P4/32
  - [-1, 1, PatchMerging_FasterNet, [320, 2, 2]] # 6
  - [-1, 2, BasicStage, [320, 1]] # 7
  - [-1, 1, SPPF, [320, 5]] # 8
  - [-1, 1, PSA, [320]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 1, C2f, [512]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 1, C2fCIB, [1024, True, True]] # 21 (P5/32-large)

  - [[15, 18, 21], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
