nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv10 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# YOLOv10 AFPN head
head:
  - [4, 1, Conv, [128, 1, 1]] # 11 downsample backbone P3
  - [6, 1, Conv, [256, 1, 1]] # 12 downsample backbone P4

  - [[11, 12], 1, ASFF2, [128, 0]] # 13
  - [[11, 12], 1, ASFF2, [256, 1]] # 14

  - [-2, 1, C2f, [128, False]] # 15
  - [-2, 1, C2f, [256, False]] # 16

  - [10, 1, Conv, [512, 1, 1]] # 17 downsample backbone P5

  - [[15, 16, 17], 1, ASFF3, [128, 0]] # 18
  - [[15, 16, 17], 1, ASFF3, [256, 1]] # 19
  - [[15, 16, 17], 1, ASFF3, [512, 2]] # 20

  - [18, 1, C2fCIB, [256, True, True]] # 21 (P3/8-small) 
  - [19, 1, C2fCIB, [512, True, True]] # 22 (P4/16-medium) 
  - [20, 1, C2fCIB, [1024, True, True]] # 23 (P5/32-large) 
  - [[21, 22, 23], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
