nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  # n: [0.33, 0.25, 1024]
  # s: [0.33, 0.50, 1024]
  # m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [24, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [24, 3, 2]] # 1-P2/4
  - [-1, 2, StarBlock, [4]]
  - [-1, 1, Conv, [48, 3, 2]] # 3-P3/8
  - [-1, 2, StarBlock, [4]]
  - [-1, 1, Conv, [96, 3, 2]] # 5-P4/16
  - [-1, 8, StarBlock, [4]]
  - [-1, 1, Conv, [192, 3, 2]] # 7-P5/32
  - [-1, 3, StarBlock, [4]]
  - [-1, 1, SPPF, [192, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [96]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [48]] # 15 (P3/8-small)

  - [-1, 1, Conv, [48, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [96]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [96, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [192]] # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
