# VanillaNet6 object detection model with P3-P5 outputs. For details see https://blog.csdn.net/weixin_43694096
# Parameters
nc: 80 # number of classes
depth_multiple: 1.0 # scales module repeats
width_multiple: 1.0 # scales convolution channels

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [128, 4, 4]] # 0-P2/4
  - [-1, 1, VanillaBlock, [256, 3, 2]] # 1-P3/8
  - [-1, 1, VanillaBlock, [512, 3, 2]] # 2-P4/16
  - [-1, 1, VanillaBlock, [1024, 3, 2]] # 3-P5/32
  - [-1, 1, VanillaBlock, [1024, 3, 1]] # 4-P5/32

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 5
  - [[-1, 2], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 8
  - [[-1, 1], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 10 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 11
  - [[-1, 7], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 13 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [768, True, True]] # 16 (P5/32-large)

  - [[10, 13, 16], 1, v10Detect, [nc]] # Detect(P3, P4, P5)

