# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  l: [1.00, 1.00, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]] # 1-P2/4
  - [-1, 1, StarBlock, [4]]
  - [-1, 1, Conv, [64, 3, 2]] # 3-P3/8
  - [-1, 2, StarBlock, [4]]
  - [-1, 1, SCDown, [128, 3, 2]] # 5-P4/16
  - [-1, 6, StarBlock, [4]]
  - [-1, 1, SCDown, [256, 3, 2]] # 7-P5/32
  - [-1, 2, StarBlock, [4]]
  - [-1, 1, SPPF, [256, 5]] # 9
  - [-1, 1, PSA, [256]] # 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [128]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [64]] # 16 (P3/8-small)

  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [128]] # 19 (P4/16-medium)

  - [-1, 1, SCDown, [128, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [256, True, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
